# !-- coding:utf-8 --!
# ！这是Csdn.Applets 的例和任务
# !@File:code\Csdn\Applets\ __init__.py
# !@Author:
# !@Time:2020/1/12--20:21

#01."解决算法问题"
#02."Pygame作图"
#03."Turtle 作图“

## 01 解決算法問題
# §01.1     求 100 以内的素数
# §01.2     求自然数的平方例表
# §01.4     汉诺塔移
# -----------------------------------------
## 02 PyGame 作圖
# §02.1       绘制基本图形
# §02.2       画五角星
# §02.3       会移动的图形
# §02.4       圣诞树
# §02.5       随机画出千条线
# §02.6       碰壁变色的回力球
# §02.7       小猪佩奇
# §02.8       多個(角色)迴力球
# -----------------------------------------
## 03 Turtle 作圖
# 03.1        用海龜作圓一        §03.1 例題
# 03.2        用海龟作圆弧        §03.2.1 例题
# 03.3        小猪佩奇           §03.2.2 例题
# 03.4        递归方法画树        §03.2.3 例题
# 03.5        自定义光标          §03.3.1 例题  创建 turtle、改变造型
# 03.6        用图片创建角色       §03.3.2 例题  创建 图片 turtle
# 03.7        克隆角色            §03.3.3 例题  克隆 turtle
# 03.8        角色被點擊          §03.3.4 例题  角色被點擊
# 03.9.0      画表盘             §03.4.0 例题    畫錶盤
# 03.9.1      Turtle 動畫        §03.4.1 例题   動畫演示 慢動作和快動作
# 03.9.2      用海龜畫一口鐘       §03.4.2 例题
# 03.9.2.1    复杂的表盤                         帶有秒刻度的複雜鐘的盤面
# 03.9.2.2    一个有背景图案的钟



# 03.a1       游戏


