# -- coding:utf-8 --
#这是慕课网廖雪峰视频讲座的示例和任务
#A."Python入门"
#B."Python进阶"

# 入门篇 第13章 列表生成式
#A13.1
#A13.2
#A13.3
#A13.4
#A13.5      第四节练习和任务②③
#A13.6      同时遍历二个列表

# 進階篇 第5章 類的繼承
#B05.1      §05.1 例題
#B05.2      §05.2 任務  父類 => 子類
#B05.3      §05.3 任務  使用isinstance()判断子類實例的屬性
#B05.4      §05.4 例題  多態
#B05.5      §05.4 任務  利用 json,load(s) 讀取 read()
#B05.6      §05.5 任務  多重繼承，交叉定義實例 會打籃球的學生、會踢足球的老師
#B05.7      §05.6 例題  獲取對象信息
#B05.8      §05.6 任務  在__init__( **kw)

# 進階篇 第6章 定製類
#B06.1      §B06.1 例题  __str__() 方法
#B06.2      §B06.1 任務  __str__() 方法
#B06.3      §B06.3 例題、任務    __cmp__() 方法
#B06.4      §B06.4 例題   __len__() 方法
#B06.5      §B06.4 任務   __len__() 方法 斐波那契数列



